app/controllers/breeds_controller.rb

SELECT "dog_breeds".* FROM "dog_breeds"
---
  def dogs
    render json: DogBreed.all.to_json

SELECT "cat_breeds".* FROM "cat_breeds"
---
  def cats
    render json: CatBreed.all.to_json

SELECT "bird_breeds".* FROM "bird_breeds"
---
  def birds
    render json: BirdBreed.all.to_json